#### Install the following packages from the anaconda prompt/terminal
- sqlalchemy     
    - `pip install sqlalchemy`
- psycopg2       
    - `pip install psycopg2-binary`

In [1]:
import pandas as pd
import psycopg2 
import sqlalchemy as sa

#### Use sqlalchemy to create an `engine`; the `engine` will be used by pandas to connect to postgreSQL
- the engine needs a connection defined in this format: `postgresql://user:password@server:port/database_name`
- everything after the `//` is specific to your database

In [2]:
engine = sa.create_engine('postgresql://postgres:postgres@localhost:5432/Lahman_baseball')

#### Now you can use the pandas `read_sql( )` method
- set `sql=` the query you want to run
- set `con = engine` to execute a query on any table in the connected database

In [3]:
players = pd.read_sql(sql = 'SELECT * FROM people;', con = engine)
players.head()

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [4]:
players.columns.values

array(['playerid', 'birthyear', 'birthmonth', 'birthday', 'birthcountry',
       'birthstate', 'birthcity', 'deathyear', 'deathmonth', 'deathday',
       'deathcountry', 'deathstate', 'deathcity', 'namefirst', 'namelast',
       'namegiven', 'weight', 'height', 'bats', 'throws', 'debut',
       'finalgame', 'retroid', 'bbrefid'], dtype=object)

In [5]:
players.loc[players.height.idxmin()]

playerid          gaedeed01
birthyear              1925
birthmonth                6
birthday                  8
birthcountry            USA
birthstate               IL
birthcity           Chicago
deathyear              1961
deathmonth                6
deathday                 18
deathcountry            USA
deathstate               IL
deathcity           Chicago
namefirst             Eddie
namelast             Gaedel
namegiven       Edward Carl
weight                   65
height                   43
bats                      R
throws                    L
debut            1951-08-19
finalgame        1951-08-19
retroid            gaede101
bbrefid           gaedeed01
Name: 5843, dtype: object

In [7]:
players.loc[players.height.idxmax()]

playerid         rauchjo01
birthyear             1978
birthmonth               9
birthday                27
birthcountry           USA
birthstate              KY
birthcity       Louisville
deathyear              NaN
deathmonth             NaN
deathday               NaN
deathcountry          None
deathstate            None
deathcity             None
namefirst              Jon
namelast             Rauch
namegiven        Jon Erich
weight                 290
height                  83
bats                     R
throws                   R
debut           2002-04-02
finalgame       2013-05-17
retroid           raucj001
bbrefid          rauchjo01
Name: 14143, dtype: object

In [6]:
team = pd.read_sql(sql = 'SELECT * FROM teams;', con = engine)
team.head()

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,dp,fp,name,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro
0,1871,NA,BS1,BNA,None,3,31,NaN,20,10,...,NaN,0.838,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NA,CH1,CNA,None,2,28,NaN,19,9,...,NaN,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NA,CL1,CFC,None,8,29,NaN,10,19,...,NaN,0.814,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NA,FW1,KEK,None,7,19,NaN,7,12,...,NaN,0.803,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NA,NY2,NNA,None,5,33,NaN,16,17,...,NaN,0.839,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2

In [8]:
homegames = pd.read_sql(sql = 'SELECT * FROM homegames', con = engine)
homegames.head()

,year,league,team,park,span_first,span_last,games,openings,attendance
0,1871,NA,BS1,BOS01,1871-05-16,1871-10-07,16,16,32600
1,1871,NA,BS1,NYC01,1871-05-27,1871-05-27,1,1,3000
2,1871,NA,CH1,CHI01,1871-05-08,1871-09-29,16,15,85500
3,1871,NA,CH1,NYC01,1871-10-30,1871-10-30,1,1,600
4,1871,NA,CL1,CIN01,1871-05-13,1871-07-22,2,2,2200